
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	Index1C 	= ОбъектОбработка.ПолучитьМакет("Index1C");
	codemirror 	= ОбъектОбработка.ПолучитьМакет("codemirror");
	OneCfold 	= ОбъектОбработка.ПолучитьМакет("OneCfold");
	foldcode 	= ОбъектОбработка.ПолучитьМакет("foldcode");
	foldgutter 	= ОбъектОбработка.ПолучитьМакет("foldgutter");
	OneC 		= ОбъектОбработка.ПолучитьМакет("OneC");
	css 		= ОбъектОбработка.ПолучитьМакет("css");
	
	ТекстIndex1C = Index1C.ПолучитьТекст();
	
	ТекстIndex1C = СтрЗаменить(ТекстIndex1C, "&codemirror&", codemirror.ПолучитьТекст());
	ТекстIndex1C = СтрЗаменить(ТекстIndex1C, "&OneCfold&", OneCfold.ПолучитьТекст());
	ТекстIndex1C = СтрЗаменить(ТекстIndex1C, "&foldcode&", foldcode.ПолучитьТекст());
	ТекстIndex1C = СтрЗаменить(ТекстIndex1C, "&foldgutter&", foldgutter.ПолучитьТекст());
	ТекстIndex1C = СтрЗаменить(ТекстIndex1C, "&OneC&", OneC.ПолучитьТекст());
	ТекстIndex1C = СтрЗаменить(ТекстIndex1C, "&css&", css.ПолучитьТекст());
	
	ПроизвольныйТекст = ТекстIndex1C;
	
КонецПроцедуры

#КонецОбласти
